In [1]:
#Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

In [72]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [73]:
password = getpass.getpass()

········

In [74]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM actor', engine)

In [75]:
#How many distinct (different) actors' last names are there? 66 distinct last names.
query = '''SELECT COUNT(DISTINCT last_name) AS count_of_last_name
FROM sakila.actor;'''
distinct_name = pd.read_sql_query(query, engine)

In [76]:
distinct_name.head()

   count_of_last_name
0                 121

In [108]:
#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
query = '''SELECT rental_date, DATE_FORMAT(rental_date, '%%M') AS month
, DATE_FORMAT(rental_date, '%%W') AS weekday
, CASE
WHEN DATE_FORMAT(rental_date, '%%w') > 5 THEN 'weekend'
ELSE 'workday'
END AS day_type
FROM sakila.rental;'''

In [109]:
week_work_day = pd.read_sql_query(query, engine)

In [110]:
week_work_day.head()

          rental_date month  weekday day_type
0 2005-05-24 22:53:30   May  Tuesday  workday
1 2005-05-24 22:54:33   May  Tuesday  workday
2 2005-05-24 23:03:39   May  Tuesday  workday
3 2005-05-24 23:04:41   May  Tuesday  workday
4 2005-05-24 23:05:21   May  Tuesday  workday

In [111]:
#Get all films with ARMAGEDDON in the title.
query = '''SELECT title
FROM sakila.film
WHERE title LIKE '%%ARMAGEDDON%%';'''

In [112]:
armaggedon = pd.read_sql_query(query, engine)

In [113]:
armaggedon.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

In [122]:
#Get 10 the longest films.
query = '''SELECT title, length
FROM sakila.film
ORDER BY length DESC
LIMIT 10;'''

In [123]:
longest_film = pd.read_sql_query(query, engine)

In [124]:
longest_film.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [149]:
#How many films include Behind the Scenes content?
query = '''SELECT COUNT(special_features)
FROM sakila.film
WHERE special_features LIKE '%%Behind the Scenes%%';'''

In [150]:
behind_the_scenes = pd.read_sql_query(query, engine)

In [152]:
behind_the_scenes.head()

   COUNT(special_features)
0                      538

In [156]:
#Which kind of movies (rating) have a mean duration of more than two hours?
query = '''SELECT rating
, ROUND(AVG(length),2) AS mean_length
FROM sakila.film
GROUP BY 1
HAVING mean_length > 120;'''

In [157]:
longer_than_2h = pd.read_sql_query(query, engine)

In [158]:
longer_than_2h.head()

  rating  mean_length
0  PG-13       120.44

In [169]:
#Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.
query = '''SELECT title
, length
, RANK() OVER (ORDER BY length DESC) AS film_rank
FROM sakila.film
WHERE length IS NOT NULL
AND length > 0;'''

In [170]:
rank = pd.read_sql_query(query, engine)

In [172]:
rank.head(20)

                 title  length  film_rank
0        CHICAGO NORTH     185          1
1       CONTROL ANTHEM     185          1
2       DARN FORRESTER     185          1
3          GANGS PRIDE     185          1
4            HOME PITY     185          1
5        MUSCLE BRIGHT     185          1
6         POND SEATTLE     185          1
7   SOLDIERS EVOLUTION     185          1
8    SWEET BROTHERHOOD     185          1
9         WORST BANGER     185          1
10   CONSPIRACY SPIRIT     184         11
11    CRYSTAL BREAKING     184         11
12      KING EVOLUTION     184         11
13     MOONWALKER FOOL     184         11
14     SMOOCHY CONTROL     184         11
15      SONS INTERVIEW     184         11
16      SORORITY QUEEN     184         11
17      THEORY MERMAID     184         11
18       CATCH AMISTAD     183         19
19      FRONTIER CABIN     183         19